---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.FinalizedElementsWillBeDeleted
source: html/8bc9049f-ed65-646e-9db3-114e3a1f940f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.FinalizedElementsWillBeDeleted Property

Can't find new hosts for this Element.\nIt will be deleted on Finish Paste unless repositioned or rehosted.

## Syntax (C#)
```csharp
public static FailureDefinitionId FinalizedElementsWillBeDeleted { get; }
```